import random
from nonebot.adapters import Bot, Event
from nonebot.plugin import on_keyword
from nonebot.rule import to_me

food = [
    "M记","沙县小吃","开封菜", '馄饨','拉面','烩面','热干面','刀削面','油泼面','炸酱面','炒面','重庆小面','米线','酸辣粉','土豆粉','螺狮粉','凉皮儿','麻辣烫','肉夹馍','羊肉汤','炒饭','盖浇饭','卤肉饭','烤肉饭','黄焖鸡米饭','驴肉火烧','麻辣香锅','火锅','酸菜鱼','烤串','披萨','烤鸭','汉堡','炸鸡','寿司','蟹黄包','粽子','煎饼果子','生煎','炒年糕',"我一拳",
    '糖醋排骨','鱼香肉丝','水煮鱼','宫保鸡丁','麻婆豆腐','红烧肉','夫妻肺片','回锅肉','棒棒鸡','醋熘鸡','大杂烩','东坡肉','东坡鱼','泡菜鱼','鸡豆花','瓤莲藕','板栗烧鸡','烤小鸡','雪梨肘棒','素锅烤鸭','锅塌鸡签','锅烧鸡','烤花揽桂鱼','纸包鸡','泰安三美豆腐',
    '芝麻鱼球','拔丝苹果','熬黄花鱼','红烧鱼唇','龙凤双腿','四喜鸭子','泰山赤鳞鱼','酥炸春花肉','炸豆腐丸子','胡椒海参汤','双烤肉','奶汤银肺',
    '换心乌贼','馏鱼片','炸菠菜脯','麻粉肘子','双味蹄筋','荷叶肉','福山烧小鸡','素火腿','冬菇烧蹄筋','砂锅三味','奶汤鲜核桃仁','什锦蜂窝豆腐',
    '山东菜丸','烧罗汉面筋','锅烧鸭','整鱼两吃','焖大虾','蜜汁金枣','龙眼凤肝','蜜汁梨球','凤尾金鱼','蒜苗火鸡排','烤花揽鳜鱼','杨梅虾球','酒香椒盐肘子','奶汤蒲菜','清汤柳叶燕菜','油爆双脆',
    '玛瑙银杏','炒豆腐脑','番茄松鼠鱼','珊瑚金钩','扒酿海参','落叶琵琶虾','南煎丸子','龙潭钓玉牌','软烧豆腐','炸灌汤丸子','紫桂焖大排','全虾三做','辣拌血蛤','香煎茄片','炒桂花鱼翅','蒜子焖酣鱼',
    '广式卤鸭翅','西汁乳鸽','客家酿豆腐','甘菊猪肚','烧瓤鲜沙虫','子萝鸭片','金陵片皮鸭','口福鸡','花雕鸡','果汁鹌鹑','打边炉','金龙乳猪','红斑二吃','蜜汁叉烧','清烩海参','古法扣全端',
    '乳酸菌果汁酱','京乳藕片','枸杞猪肝瘦肉汤','咕噜肉','红烧猪手','三色龙虾','三皮丝','嘉禾雁扣','蒜香鲶鱼','牛蒡香羹','雪花片汤','灵芝鸡汤','干炒牛河','金银菜东菇墨鱼煲猪踭','香蕉百合银耳汤','凉拌海蜇',
    '兰度鸽脯','辣子鸡','茄汁明虾','脆薯凤尾虾','鱼胶圆肉炖水鸭','海参炖瘦肉','秘制国药中华鳖','西柠蜜糖乳鸽','皱纹圆蹄','莲子山药粥','剑花蜜枣猪肺汤','园林香液鸡','酸汤龙骨面','红扒羊肉','蜜椒蝴蝶片','五柳脆皮鱼','白玉翡翠','梅菜蒸鱼尾','马铃薯笋焖鸡','肉酿生麸圆',
    '豆泥红枣','苹果牛肉炖煮','罗汉果焖瓜子鸡','椰盅海皇','昆布海藻瘦肉汤','青蒜鲤鱼汤','粟米香菇排骨汤','三蛇羹','爆人参鸡片','双菇炖南蛇','蚝油生菜','黑鸡拆烩老猫公','芥菜咸蛋鱼头汤','香荽鱼松酿银萝','梨花豆腐汤','萝卜泡菜','苹果炖鱼','贝丝扒菜胆','凤梨烩排骨','可口的葡萄醋','牛蒡沙拉','沙丁鱼烙','淳安辣椒酱','溜肝尖','西柚三文鱼','鲜竹牛肉','凉瓜浸田鸡','舒心驻颜老火汤','八珍鲩鱼','清汤银耳','玉须泥鳅汤','什锦烩饭','糖拌菜心','糟油青鱼划水','菠萝龙眼鱼','麻酱拌豆腐','虾米拌豆腐','酸菜鱼','可乐鸡翅','酸辣土豆丝','东坡肘子','蒜烧排骨','醋熘土豆丝','彩椒鲜虾仁','香菇豆腐饼','百合炒鱼片','鱼香豆腐','鸡蛋炒西红柿','客家小炒','凉拌茄子','炝三丝','青椒肉片','椒盐排骨','酱焖鲫鱼','酸辣口水鸡','土豆炖豆角','双菜炒素鸡','脆炒南瓜丝','芋头扣肉','糖醋鱼','皮蛋豆腐',
    '银耳川鸭','一品鲳','爆炒羊肚','蛋拌豆腐','龙须燕丸','炸鸡排','生炒海蚌','七星丸','沙锅鳝鱼','什锦豆腐煲','香油石鳞','干贝水晶鸡','肉米鱼唇','蛏溜奇','白焯响螺','油条西舌','闽生果','金钱干贝','银杏芋泥','香露全鸡','一品鲍鱼','醉排骨','苦中作乐','玟瑰大虾','马蹄鸡丁','椒盐肚尖','太极芋头','佛跳墙','厦门薄饼','沙司牛尾','八生火锅','水晶蹄膀香肴肉','炒芙蓉蟹','龙身凤尾虾','鱼腩煲','彩色肉丝','荤罗汉','糟片鸭','西瓜盅','干烧牛肉片','芝麻豆腐','拉糟鱼块',
    '羊肉汤锅','红枣煨肘','炖牛掌','网油鱼包','炒豌豆夹','红烧牛腩','蚕豆炒虾仁','凉粉鲫鱼','红油抄手','干煸鳝鱼丝','糊涂鸡','连理双味鱼','南荠烧鸭丁','蓉城鸳鸯卷','虾须牛肉','辣椒蟹','川家常酸辣汤','泡菜肉末','陈皮牛肉','火鞭牛肉','紫龙脱袍','麻辣子鸡','组庵鱼翅','发丝百叶','水煮猪杂','煎连壳蟹','干锅腊味河蚌','金鱼戏莲','潇湘猪手','麻辣田鸡腿','辣椒炒肚片','炸八块','芙蓉鲫鱼','葵花虾饼','酸辣鸡丁','风情羊柳','翠竹粉蒸鱼','东安鸡','腊味合蒸','浪花天香鱼','好丝百叶','玻璃鲜墨','口味虾','酸辣肘子','黔味大虾','老妈子带鱼','清汤柴把鸭','马蹄白果蛋花汤','东安子鸡','酸辣狗肉','辣椒鱼','洞庭金龟','麻仁香酥鸭','开屏柴把桂鱼','干锅手撕包菜','菊花青鱼','火腿炒茄瓜','剁椒鱼头','冰糖湘莲'
]
length = len(food)

eat = on_keyword(['午饭', '午餐', '中饭', '晚饭', '晚餐', '夜宵', '中午', '晚上', '半夜', '吃', '恰'], rule=to_me(), priority=5)

@eat.handle()
async def _(bot: Bot, event: Event):
    j = random.randint(0, length-1)
    await eat.finish("吃" + food[j] + '！')

breakfast = on_keyword(['早饭', '早餐'], rule=to_me(), priority=5)
@breakfast.handle()
async def _(bot: Bot, event: Event):
    await eat.finish("笑死，带学生还吃早饭？")

bour = on_keyword(['下午茶'], rule=to_me(), priority=5)
@bour.handle()
async def _(bot: Bot, event: Event):
    await eat.finish("小布尔乔亚行为！把你图图了！")